modm-ext/data.modm.io/docs/svd/header_stm32f071xb.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP12_COMMON</name>
      <groupName>COMP_Common</groupName>
      <alternatePeripheral>COMP</alternatePeripheral>
      <baseAddress>0x4001001c</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register, used for bits common to several COMP instances</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1SW1</name>
              <description>COMP1 SW1 switch control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PA1 for COMP1, pin PA3 for COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input plus connected to DAC1 channel 1 (DAC_OUT1), through dedicated switch (Note: this switch is solely intended to redirect signals onto high impedance input, such as COMP1 input plus (highly resistive switch)) (specific to COMP instance: COMP1)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1MODE</name>
              <description>COMP1 power mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWPOWER</name>
                  <description>COMP power mode to low power</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <description>COMP power mode to ultra-low power</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1INSEL</name>
              <description>COMP1 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH2</name>
                  <description>Comparator input minus connected to DAC1 channel 2 (DAC_OUT2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PA0 for COMP1, pin PA2 for COMP2)</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1OUTSEL</name>
              <description>COMP1 output select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>COMP output is not connected to other peripherals (except GPIO and EXTI that are always connected to COMP output)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_BKIN</name>
                  <description>COMP output connected to TIM1 break input (BKIN)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_IC1</name>
                  <description>COMP output connected to TIM1 input capture 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OCCLR</name>
                  <description>COMP output connected to TIM1 OCREF clear</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_IC4</name>
                  <description>COMP output connected to TIM2 input capture 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OCCLR</name>
                  <description>COMP output connected to TIM2 OCREF clear</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_IC1</name>
                  <description>COMP output connected to TIM3 input capture 1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OCCLR</name>
                  <description>COMP output connected to TIM3 OCREF clear</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1POL</name>
              <description>COMP1 output polarity</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1HYST</name>
              <description>COMP1 hysteresis</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1OUT</name>
              <description>COMP1 output level</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1LOCK</name>
              <description>COMP1 lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2MODE</name>
              <description>COMP2 power mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2INSEL</name>
              <description>COMP2 inverting input select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>WNDWEN</name>
              <description>COMPx window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Window mode disable: Comparators 1 and 2 are independent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1_INPUT_PLUS_COMMON</name>
                  <description>Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP1 input plus (COMP2 input plus is no more accessible).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP2OUTSEL</name>
              <description>COMP2 output select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMP2POL</name>
              <description>COMP2 output polarity</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2HYST</name>
              <description>COMP2 hysteresis</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP2OUT</name>
              <description>COMP2 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2LOCK</name>
              <description>COMP2 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
